garyPenhook/PyAvrOCD/svd/avr64ea28.svd
        <register>
          <name>CHANNEL3</name>
          <description>Multiplexer Channel 3</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel generator select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI_SYNCH</name>
                  <description>UPDI SYNCH character</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PITEV0</name>
                  <description>Periodic Interrupt Timer Event 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PITEV1</name>
                  <description>Periodic Interrupt Timer Event 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT2</name>
                  <description>Configurable Custom Logic LUT2</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT3</name>
                  <description>Configurable Custom Logic LUT3</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1_OUT</name>
                  <description>Analog Comparator 1 out</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_RES</name>
                  <description>ADC 0 Result Ready</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_SAMP</name>
                  <description>ADC 0 Sample Ready</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_WCMP</name>
                  <description>ADC 0 Window Compare</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_EV0</name>
                  <description>Port A Event 0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_EV1</name>
                  <description>Port A Event 1</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_EV0</name>
                  <description>Port C Event 0</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_EV1</name>
                  <description>Port C Event 1</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_EV0</name>
                  <description>Port D Event 0</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_EV1</name>
                  <description>Port D Event 1</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_EV0</name>
                  <description>Port F Event 0</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_EV1</name>
                  <description>Port F Event 1</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0_XCK</name>
                  <description>USART 0 XCK</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_XCK</name>
                  <description>USART 1 XCK</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_XCK</name>
                  <description>USART 2 XCK</description>
                  <value>98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>SPI 0 SCK</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 overflow / low byte timer underflow</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 high byte timer underflow</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0_LCMP0</name>
                  <description>Timer/Counter A0 compare 0 / low byte timer compare 0</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1_LCMP1</name>
                  <description>Timer/Counter A0 compare 1 / low byte timer compare 1</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2_LCMP2</name>
                  <description>Timer/Counter A0 compare 2 / low byte timer compare 2</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_OVF_LUNF</name>
                  <description>Timer/Counter A1 overflow / low byte timer underflow</description>
                  <value>136</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_HUNF</name>
                  <description>Timer/Counter A1 high byte timer underflow</description>
                  <value>137</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_CMP0_LCMP0</name>
                  <description>Timer/Counter A1 compare 0 / low byte timer compare 0</description>
                  <value>140</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_CMP1_LCMP1</name>
                  <description>Timer/Counter A1 compare 1 / low byte timer compare 1</description>
                  <value>141</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_CMP2_LCMP2</name>
                  <description>Timer/Counter A1 compare 2 / low byte timer compare 2</description>
                  <value>142</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_CAPT</name>
                  <description>Timer/Counter B0 capture</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_OVF</name>
                  <description>Timer/Counter B0 overflow</description>
                  <value>161</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_CAPT</name>
                  <description>Timer/Counter B1 capture</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_OVF</name>
                  <description>Timer/Counter B1 overflow</description>
                  <value>163</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2_CAPT</name>
                  <description>Timer/Counter B2 capture</description>
                  <value>164</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2_OVF</name>
                  <description>Timer/Counter B2 overflow</description>
                  <value>165</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB3_CAPT</name>
                  <description>Timer/Counter B3 capture</description>
                  <value>166</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB3_OVF</name>
                  <description>Timer/Counter B3 overflow</description>
                  <value>167</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL4</name>
          <description>Multiplexer Channel 4</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel generator select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI_SYNCH</name>
                  <description>UPDI SYNCH character</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PITEV0</name>
                  <description>Periodic Interrupt Timer Event 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PITEV1</name>
                  <description>Periodic Interrupt Timer Event 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT2</name>
                  <description>Configurable Custom Logic LUT2</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT3</name>
                  <description>Configurable Custom Logic LUT3</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1_OUT</name>
                  <description>Analog Comparator 1 out</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_RES</name>
                  <description>ADC 0 Result Ready</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_SAMP</name>
                  <description>ADC 0 Sample Ready</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_WCMP</name>
                  <description>ADC 0 Window Compare</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_EV0</name>
                  <description>Port A Event 0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_EV1</name>
                  <description>Port A Event 1</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_EV0</name>
                  <description>Port C Event 0</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_EV1</name>
                  <description>Port C Event 1</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_EV0</name>
                  <description>Port D Event 0</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_EV1</name>
                  <description>Port D Event 1</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_EV0</name>
                  <description>Port F Event 0</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_EV1</name>
                  <description>Port F Event 1</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0_XCK</name>
                  <description>USART 0 XCK</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_XCK</name>
                  <description>USART 1 XCK</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_XCK</name>
                  <description>USART 2 XCK</description>
                  <value>98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>SPI 0 SCK</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 overflow / low byte timer underflow</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 high byte timer underflow</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0_LCMP0</name>
                  <description>Timer/Counter A0 compare 0 / low byte timer compare 0</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1_LCMP1</name>
                  <description>Timer/Counter A0 compare 1 / low byte timer compare 1</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2_LCMP2</name>
                  <description>Timer/Counter A0 compare 2 / low byte timer compare 2</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_OVF_LUNF</name>
                  <description>Timer/Counter A1 overflow / low byte timer underflow</description>
                  <value>136</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_HUNF</name>
                  <description>Timer/Counter A1 high byte timer underflow</description>
                  <value>137</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_CMP0_LCMP0</name>
                  <description>Timer/Counter A1 compare 0 / low byte timer compare 0</description>
                  <value>140</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_CMP1_LCMP1</name>
                  <description>Timer/Counter A1 compare 1 / low byte timer compare 1</description>
                  <value>141</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_CMP2_LCMP2</name>
                  <description>Timer/Counter A1 compare 2 / low byte timer compare 2</description>
                  <value>142</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_CAPT</name>
                  <description>Timer/Counter B0 capture</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_OVF</name>
                  <description>Timer/Counter B0 overflow</description>
                  <value>161</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_CAPT</name>
                  <description>Timer/Counter B1 capture</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_OVF</name>
                  <description>Timer/Counter B1 overflow</description>
                  <value>163</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2_CAPT</name>
                  <description>Timer/Counter B2 capture</description>
                  <value>164</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2_OVF</name>
                  <description>Timer/Counter B2 overflow</description>
                  <value>165</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB3_CAPT</name>
                  <description>Timer/Counter B3 capture</description>
                  <value>166</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB3_OVF</name>
                  <description>Timer/Counter B3 overflow</description>
                  <value>167</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
